o5e/o5e_firmware/o5e/src/FreeScale/mpc5500_ccdcfg.c
/**************************************************************************/
/* FILE NAME: mpc5500_ccdcfg.c               COPYRIGHT (c) Freescale 2004 */
/*                                                All Rights Reserved     */
/* DESCRIPTION:                                                           */
/* This file contains functions for the MPC5500 assembly configuration.   */
/* The user does not need to make any changes in this file.               */
/* The user will change function field values in mpc5500_ccdcfg.h.        */
/* Choices for field values are found in mpc5500_ccdcfg.h.                */
/*========================================================================*/
/* REV      AUTHOR       DATE       DESCRIPTION OF CHANGE                 */
/* ---   -----------   ----------   ---------------------                 */
/* 0.1   J. Yokubaitis 24/Nov/03     Initial version                      */
/* 0.2   G. Jackson    15/Mar/04     Split into C code configuration      */
/* 0.3   G. Jackson    15/Apr/04     C application functions removed      */
/* 0.4   G. Jackson    13/May/04     Added CS2 and CS3 initializations    */
/* 0.5   G. Jackson    08/Jun/04     Added PCR initialization for the     */
/*                                    external bus and chip select 0 (CS0)*/
/*                                    with external boot config option    */
/*                                    control.                            */
/* 0.6   G. Jackson    10/Jun/04     Changed EXT_BOOT to INT_BOOT as a    */
/*                                   config option in mpc5500_usrccdcfg.h.*/
/* 1.0   G. Jackson    30/Jun/04     Changed INT_BOOT to I_EXT_BUS_EN     */
/*                                    Added I_DATA_PORT_SIZE              */
/*                                    Added I_CFG_PBRG_XBAR               */
/* 1.1   C. Baker      19/Jul/06     Removed device specific #include,    */
/*                                     renamed cfg_mpc5500ccd to cfg_5500 */
/* 1.2   Chris Baker   25/Oct/06     Split I_CFG_PBRG_XBAR into I_CFG_PBRG*/
/*                                     and I_CFG_XBAR                     */
/*                                   Added XBAR configurations for all    */
/*                                     devices to cfg_XBAR                */
/**************************************************************************/

#include "config.h"
#include "mpc5500_usrccdcfg.h"
#include "mpc563xm.h"


/***************************************************************************/
/* FUNCTION     : cfg_mpc5500ccd()                                         */
/* PURPOSE      : This function provides "C" code configuration for the    */
/*                 MPC5500 family device. Previous initialization has set  */
/*                 up the FMPLL clock speed, internal SRAM and the stack.  */
/*                 The cfg_mpc5500ccd function completes initialization by */
/*                 making desired changes to the XCLKS, EBI chip selects,  */
/*                 with default settings for PBRIDGE_A, PBRIDGE_B, and the */
/*                 XBAR.                                                   */
/*                                                                         */
/*                 In cases where (numerous) alternative initializations   */
/*                 are desired, a sample configuration is included here.   */  
/*                 Actual initialization required for a specific system    */ 
/*                 remains the responsibility of the developer.            */
/* INPUT NOTES  : (from mpc5500_usrcdefs.h) I_CFG_XCLKS, I_EXT_BUS_EN,     */
/*                  I_CFG_PBRG, I_CFG_XBAR                                 */
/* RETURN NOTES : None                                                     */
/* WARNING      : An external boot will configure CS0, the address bus,    */
/*                 and the data bus; I_EXT_BUS_EN = YES will reconfigure   */
/*                 the external bus with settings in mpc5500_usrcdefs.h.   */                        
/***************************************************************************/

/* MPC5500 initialization functions */
void cfg_mpc5500ccd() {
	
/*void cfg_5500(uint8_t External_Boot) { */
   if(I_CFG_XCLKS) {   /* Option to change external clock speeds */
     cfg_XCLKS();      /* Set up the External Clock speeds */
    }                  /* end I_CFG_XCLKS */

   if(I_EXT_BUS_EN) {  /* Set up external bus if enabled */

     cfg_PCR();        /* Set up Pad Configuration Registers for external bus */ 

     cfg_EBI();        /* Configure the External Bus Interface Chip Selects */

    }                  /* end external bus enable */ 

   if(I_CFG_PBRG) {  /* Skip if not configuring PBRIDGEs */
                          /* NOTE: These steps may not be necessary.    */
                          /*       The user must know the exact effect. */

     cfg_PBRIDGE();    /* Configure PBRIDGE_A and PBRIDGE_B. */
    }

   if(I_CFG_XBAR) {  /* Skip if not configuring XBAR */
                          /* NOTE: These steps may not be necessary.    */
                          /*       The user must know the exact effect. */
     cfg_XBAR();       /* Configure the XBAR master/slave channel priorities. */
    }


} /* End of cfg_mpc5500ccd()  */


/**************************************************************************/
/*                       C Code Functions                                 */
/**************************************************************************/


/*************************************************************************/
/* FUNCTION     : cfg_XCLKS                                              */
/* PURPOSE      : This function configures the external clocks (CLKOUT   */
/*                 and ENGCLK). The PCRs are also set for these 2 pins.  */
/* INPUT NOTES  : I_CFG_XCLKS -- used to permit external clock changes.  */
/*                               Defined in mpc5500_usrcdefs.h           */
/* RETURN NOTES : None                                                   */
/* WARNING      : None                                                   */
/*************************************************************************/

void cfg_XCLKS() 
{

/* This function configures the external clocks */
/*   Engineering clock is set to divide by 128    */
/*   CLKOUT is set to divide-by-2                 */

/* Set the value for Pad Configuration Register (PCR214) for ENGCLK */
    SIU.PCR[214].R = (OBE_ENGCLK_VAL | DSC_ENGCLK_VAL);


/* Set the value for Pad Configuration Register (PCR229) for CLKOUT */
    SIU.PCR[229].R = (OBE_CLKOUT_VAL | DSC_CLKOUT_VAL);

/* Set the value for the external clocks */

    SIU.ECCR.R = (ECCR_ENGDIV | ECCR_EBTS | ECCR_EBDF);

