o5e/o5e_firmware/o5e/src/FreeScale/mpc5500_ccdcfg.c
} /* End of cfg_XCLKS  */

/******************************************************************/
/* FUNCTION     : cfg_PCR                                         */
/* PURPOSE      : This function configures the SIU PCR's for      */
/*                  external bus operation.                       */
/* INPUT NOTES  : None                                            */
/* RETURN NOTES : None                                            */
/* WARNING      : This function will be skipped if there is       */
/*                 an external boot.                              */
/*                Entries for *_C1 and *_C2 are control variables */
/*                Entries for *_CG1 through *_CG4 are Control     */
/*                 Group numbers. A Control Group is independent  */
/*                 of the control variables (*_C1,etc.)           */
/* ****************************************************************/
void cfg_PCR()
{

/* This function configures the Pad Configuration Registers (PCR's) for ADDR[8:31] */
    cfg_PCR_ADDR(PA_A_VAL, OBE_A_VAL, IBE_A_VAL, DSC_A_VAL, ODE_A_VAL, HYS_A_VAL, SRC_A_VAL, WPE_A_VAL, WPS_A_VAL);

/* This function configures the Pad Configuration Registers (PCR's) for DATA[0:15] */
    cfg_PCR_DATA(PA_DL, OBE_DL, IBE_DL, DSC_DL, ODE_DL, HYS_DL, SRC_DL, WPE_DL, WPS_DL, DATA_BYT_MSB);

/* This function configures the Pad Configuration Registers (PCR's) for DATA[16:31] */
/*  This function call is not needed for a 16-bit external data bus */
  if(I_DATA_PORT_SIZE == 32) {
    cfg_PCR_DATA(PA_DH, OBE_DH, IBE_DH, DSC_DH, ODE_DH, HYS_DH, SRC_DH, WPE_DH, WPS_DH, DATA_BYT_LSB);
   }

/* This function configures the Pad Configuration Registers (PCR's) for Control */
    cfg_PCR_CTRL(PA_C1, OBE_C1, IBE_C1, DSC_C1, ODE_C1, HYS_C1, SRC_C1, WPE_C1, WPS_C1, FRST_PCR_CG1, PCR_CNT_CG1);

/* This function configures the Pad Configuration Registers (PCR's) for Control */
    cfg_PCR_CTRL(PA_C2, OBE_C2, IBE_C2, DSC_C2, ODE_C2, HYS_C2, SRC_C2, WPE_C2, WPS_C2,FRST_PCR_CG2, PCR_CNT_CG2);
    cfg_PCR_CTRL(PA_C2, OBE_C2, IBE_C2, DSC_C2, ODE_C2, HYS_C2, SRC_C2, WPE_C2, WPS_C2,FRST_PCR_CG3, PCR_CNT_CG3);
    cfg_PCR_CTRL(PA_C2, OBE_C2, IBE_C2, DSC_C2, ODE_C2, HYS_C2, SRC_C2, WPE_C2, WPS_C2,FRST_PCR_CG4, PCR_CNT_CG4);

}

/*****************************************************************/
/* FUNCTION     : cfg_EBI                                        */
/* PURPOSE      : This function configures the EBI Chip Selects. */
/* INPUT NOTES  : None                                           */
/* RETURN NOTES : None                                           */
/* WARNING      : None                                           */
/* ***************************************************************/
void cfg_EBI()
{
/* This function configures the module before any chip select configuration */
    cfg_EBI_mod(SIZEN_VAL, SIZE_VAL, ACGE_VAL, EXTM_VAL, EARB_VAL, EARP_VAL, MDIS_VAL, DBM_VAL);

/* This function configures the base register for a CS_0 */
    cfg_CSn_BR(CS_0, CS0_BA, CS0_PS, CS0_BL, CS0_WEBS, CS0_TBDIP, CS0_BI, CS0_V);

/* This function configures the option register for CS_0 */
/*   Chip Select 0 is targeted for external Flash with wait states */
    cfg_CSn_OR(CS_0, CS0_AM, CS0_SCY, CS0_BSCY);

/* This function configures the base register for a CS_1 */
    cfg_CSn_BR(CS_1, CS1_BA, CS1_PS, CS1_BL, CS1_WEBS, CS1_TBDIP, CS1_BI, CS1_V);

/* This function configures the option register for CS_1 */
/*   Chip Select 1 is targeted for external RAM with 4 wait states */
    cfg_CSn_OR(CS_1, CS1_AM, CS1_SCY, CS1_BSCY);

/* This function configures the base register for a CS_2 */
    cfg_CSn_BR(CS_2, CS2_BA, CS2_PS, CS2_BL, CS2_WEBS, CS2_TBDIP, CS2_BI, CS2_V);

/* This function configures the option register for CS_2 */
/*   Chip Select 1 is targeted for external RAM with 0 wait states */
    cfg_CSn_OR(CS_2, CS2_AM, CS2_SCY, CS2_BSCY);

/* This function configures the base register for a CS_3 */
    cfg_CSn_BR(CS_3, CS3_BA, CS3_PS, CS3_BL, CS3_WEBS, CS3_TBDIP, CS3_BI, CS3_V);

/* This function configures the option register for CS_3 */
/*   Chip Select 1 is targeted for external RAM with 0 wait states */
    cfg_CSn_OR(CS_3, CS3_AM, CS3_SCY, CS3_BSCY);

} /* End of cfg_EBI */

/**************************************************************************/
/*                    Beginning of SIU functions                          */
/**************************************************************************/

/******************************************************************/
/* FUNCTION     : cfg_PCR_ADDR                                    */
/* PURPOSE      : This function configures the module before any  */ 
/*                chip select configuration                       */
/* INPUT NOTES  : PA_A, OBE_A, IBE_A, DSC_A, ODE_A, HYS_A,        */
/*                SRC_A, WPE_A, WPS_A                             */
/* RETURN NOTES : None                                            */
/* WARNING      : Address PCRs 4:27 are automatically written in  */
/*                   this function.                               */
/*                1 PCR is set per 16-bit register write.         */
/******************************************************************/
void cfg_PCR_ADDR(uint16_t PA_A, uint16_t OBE_A, uint16_t IBE_A,
                  uint16_t DSC_A, uint16_t ODE_A, uint16_t HYS_A,
                  uint16_t SRC_A, uint16_t WPE_A, uint16_t WPS_A)
{
  uint8_t PCRNUM;

   for (PCRNUM=4; PCRNUM <=27; PCRNUM++) 
    {
    SIU.PCR[PCRNUM].R = (PA_A | OBE_A | IBE_A | DSC_A | ODE_A | \
                         HYS_A | SRC_A | WPE_A | WPS_A);
    }
}

/******************************************************************/
/* FUNCTION     : cfg_PCR_DATA                                    */
/* PURPOSE      : This function configures PCRs for 16 Data pins. */ 
/*                                                                */
/* INPUT NOTES  : PA_D, OBE_D, IBE_D, DSC_D, ODE_D, HYS_D,        */
/*                SRC_D, WPE_D, WPS_D, DATA_BITS                  */
/* RETURN NOTES : None                                            */
/* WARNING      : For DATA[0:15] DATA_BITS must = 0; PCR[28:43]   */
/*                For DATA[16:31] DATA_BITS must = 16; PCR[44:59] */
/*                1 PCR is set per 16-bit register write.         */
/******************************************************************/
void cfg_PCR_DATA(uint16_t PA_D, uint16_t OBE_D, uint16_t IBE_D,
                 uint16_t DSC_D, uint16_t ODE_D, uint16_t HYS_D,
                 uint16_t SRC_D, uint16_t WPE_D, uint16_t WPS_D,
                 uint8_t DATA_BITS)
{
  uint8_t PCRNUM;       /* PCRNUM starts at either 28 or 44 */

   /* 1 PCR is set per 16-bit write */
   for (PCRNUM=28+DATA_BITS; PCRNUM<(44+DATA_BITS); PCRNUM++)
    {
     SIU.PCR[PCRNUM].R = (PA_D | OBE_D | IBE_D | DSC_D | ODE_D | \
                          HYS_D | SRC_D | WPE_D | WPS_D);
    }
}


/**********************************************************************/
/* FUNCTION     : cfg_PCR_CTRL                                        */
/* PURPOSE      : This function configures the module before any      */ 
/*                chip select configuration                           */
/* INPUT NOTES  : PA_C, OBE_C, IBE_C, DSC_C, ODE_C, HYS_C,            */
/*                SRC_C, WPE_C, WPS_C, FRST_PCR, PCR_CNT              */
/* RETURN NOTES : None                                                */
/* WARNING      : FRST_PCR is the first PCR written.                  */
/*                PCR_CNT is the number of 16-bit PCR register writes.*/
/*                1 PCR is set per 16-bit register write.             */
/**********************************************************************/
void cfg_PCR_CTRL(uint16_t PA_C, uint16_t OBE_C, uint16_t IBE_C, \
                  uint16_t DSC_C, uint16_t ODE_C, uint16_t HYS_C, \
                  uint16_t SRC_C, uint16_t WPE_C, uint16_t WPS_C, \
                  uint8_t FRST_PCR, uint8_t PCR_CNT)
{
  uint8_t PCRNUM;

   for (PCRNUM=FRST_PCR; PCRNUM<(FRST_PCR+PCR_CNT); PCRNUM++)  /* PCRNUM = FRST_PCR to FRST_PCR+PCR_CNT */
    {
    SIU.PCR[PCRNUM].R = (PA_C | OBE_C | IBE_C | DSC_C | ODE_C | \
                         HYS_C | SRC_C | WPE_C | WPS_C);
                            /* 1 PCR is set per 16-bit line */
    }
}


/**************************************************************************/
/*                    Beginning of EBI functions                          */
/**************************************************************************/

/******************************************************************/
/* FUNCTION     : cfg_EBI_mod                                     */
/* PURPOSE      : This function configures the module before any  */ 
/*                chip select configuration                       */
/* INPUT NOTES  : SIZEN_val,SIZE_val,ACGE_val,EXTM_val,           */
/*                 EARB_val,EARP_val,MDIS_val,DBM_val             */
/* RETURN NOTES : None                                            */
/* WARNING      : None                                            */
/******************************************************************/
void cfg_EBI_mod(uint32_t SIZEN_val, uint32_t SIZE_val, uint32_t ACGE_val, 
                 uint32_t EXTM_val, uint32_t EARB_val, uint32_t EARP_val, 
                 uint32_t MDIS_val, uint32_t DBM_val)
{
    EBI.MCR.R = (SIZEN_val | SIZE_val | ACGE_val | EXTM_val | \
                  EARB_val | EARP_val | MDIS_val | DBM_val);
}

/******************************************************************/
/* FUNCTION     : cfg_EBI_BRn                                     */
/* PURPOSE      : This function configures the EBI chip select    */
/*                 base register.                                 */
/* INPUT NOTES  : CS_val,BM_val,PS_val,BL_val,WEBS_val,TBDIP_val, */
/*                BI_val, V_val                                   */
/* RETURN NOTES : None                                            */
/* WARNING      : None                                            */
/******************************************************************/
void cfg_CSn_BR(uint8_t CS_val, uint32_t BM_val, uint32_t PS_val,
                uint32_t BL_val, uint32_t WEBS_val, uint32_t TBDIP_val,
                uint32_t BI_val, uint32_t V_val)
{
    EBI.CS[CS_val].BR.R = (BM_val | PS_val | BL_val | WEBS_val | \
                           TBDIP_val | BI_val | V_val);
}

/******************************************************************/
/* FUNCTION     : cfg_EBI_ORn                                     */
/* PURPOSE      : This function configures the EBI chip select    */
/*                  option register.                              */
/* INPUT NOTES  : CS_val, AM_val, SCY_val, BSCY_val               */
/* RETURN NOTES : None                                            */
/* WARNING      : None                                            */
/******************************************************************/
void cfg_CSn_OR(uint8_t CS_val, uint32_t AM_val, uint32_t SCY_val,
                  uint32_t BSCY_val)
{
    EBI.CS[CS_val].OR.R = ( AM_val | SCY_val | BSCY_val );
}


/**************************************************************************/
/*                    End of EBI functions                                */
/**************************************************************************/


/**************************************************************************/
/* FUNCTION     : cfg_PBRIDGE                                             */
/* PURPOSE      : This function configures PBRIDGE A and B master         */
/*                 privilege and peripheral access control.               */
/*                 Default settings are used.                             */
/* INPUT NOTES  : PBA_MPCR,PBA_PACR0,PBA_OPACRn (where n=0,1,2)           */
/*                PBB_MPCR,PBB_PACRn,PBB_OPACRm (where n=0,2 m=0,1,2,3)   */
/*                Inputs are user defined mpc5500_ccdcfg.h                */
/* RETURN NOTES : None                                                    */
/* WARNING      : Reference: MPC5554 RM chapter 5.3                       */
/*                MPCR default value = 0x77770000;                        */
/*                PACRn & OPACRn default value = 0x44444444               */
/**************************************************************************/

