o5e/o5e_firmware/o5e/src/FreeScale/mpc5500_ccdcfg.c
#ifdef MPC5554

void cfg_PBRIDGE()
{
 /* Settings for the PBRIDGE_A   */     
    PBRIDGE_A.MPCR.R   = PBA_MPCR;
    PBRIDGE_A.PACR0.R  = PBA_PACR0;
    PBRIDGE_A.OPACR0.R = PBA_OPACR0;
    PBRIDGE_A.OPACR1.R = PBA_OPACR1;
    PBRIDGE_A.OPACR2.R = PBA_OPACR2;

 /* Settings for the PBRIDGE_B   */     
    PBRIDGE_B.MPCR.R   = PBB_MPCR;
    PBRIDGE_B.PACR0.R  = PBB_PACR0;
    PBRIDGE_B.PACR2.R  = PBB_PACR2;
    PBRIDGE_B.OPACR0.R = PBB_OPACR0;
    PBRIDGE_B.OPACR1.R = PBB_OPACR1;
    PBRIDGE_B.OPACR2.R = PBB_OPACR2;
    PBRIDGE_B.OPACR3.R = PBB_OPACR3;
} /* End of cfg_PBRIDGE */

#endif

/*************************************************************************/
/* FUNCTION     : cfg_XBAR                                               */
/* PURPOSE      : This function configures the Cross Bar (XBAR) master   */
/*                 channel priorities and slave port configurations.     */
/*                 Default settings are used.                            */
/* INPUT NOTES  : MPRn_MST2,MPRn_MST1,MPRn_MST0 (where n=0,1,3,6,7)      */
/*                SGPCRn_RO, SGPCRn_ARB, SGPCRn_PCTL, SGPCRn_PARK        */
/*                                              (where n=0,1,3,6,7)      */
/*                Inputs are user defined mpc5500_ccdcfg.h               */
/* RETURN NOTES : None                                                   */
/* WARNING      : MPRn default value = 0x00000210                        */
/*                SGPCRn default value = 0x00000000                      */
/*************************************************************************/

void cfg_XBAR()
{
	/* Priority settings for the masters on each XBAR channel */
	/* highest priority = 0                                   */

	#if defined(_MPC5533_) || defined(_MPC5534_)
		/* In some cases the core could dominate the use of the   */
		/*   flash slave port because there is no cache.          */
		/* Setting the core instruction port to a lower priority  */
		/*   ensures other masters are able to access the flash.  */

		/* Master0 (core instruction) priority 2                  */
		/* Master1 (eDMA)             priority 0                  */
		/* Master2 (EBI)              priority 3                  */
		/* Master4 (core load/store)  priority 1                  */
		XBAR.MPR0.R = ( MPR0_MST4 | MPR0_MST2 | MPR0_MST1 | MPR0_MST0 );
		XBAR.MPR1.R = ( MPR1_MST4 | MPR1_MST2 | MPR1_MST1 | MPR1_MST0 );
		XBAR.MPR3.R = ( MPR3_MST4 | MPR3_MST2 | MPR3_MST1 | MPR3_MST0 );
		XBAR.MPR6.R = ( MPR6_MST4 | MPR6_MST2 | MPR6_MST1 | MPR6_MST0 );
		XBAR.MPR7.R = ( MPR7_MST4 | MPR7_MST2 | MPR7_MST1 | MPR7_MST0 );
	#endif /* _MPC5533_ | _MPC5534_ */

	#if defined(_MPC5553_) || defined(_MPC5566_)
		/* Master0 (core) priority 0                              */
		/* Master1 (eDMA) priority 1                              */
		/* Master2 (EBI)  priority 2                              */
		/* Master3 (FEC)  priority 3                              */
		XBAR.MPR0.R = ( MPR0_MST3 | MPR0_MST2 | MPR0_MST1 | MPR0_MST0 );
		XBAR.MPR1.R = ( MPR1_MST3 | MPR1_MST2 | MPR1_MST1 | MPR1_MST0 );
		XBAR.MPR3.R = ( MPR3_MST3 | MPR3_MST2 | MPR3_MST1 | MPR3_MST0 );
		XBAR.MPR6.R = ( MPR6_MST3 | MPR6_MST2 | MPR6_MST1 | MPR6_MST0 );
		XBAR.MPR7.R = ( MPR7_MST3 | MPR7_MST2 | MPR7_MST1 | MPR7_MST0 );
	#endif /* _MPC5553_ | _MPC5566_ */

	#ifdef _MPC5554_
		/* Master0 (core) priority 0                              */
		/* Master1 (eDMA) priority 1                              */
		/* Master2 (EBI)  priority 2                              */
		XBAR.MPR0.R = ( MPR0_MST2 | MPR0_MST1 | MPR0_MST0 );
		XBAR.MPR1.R = ( MPR1_MST2 | MPR1_MST1 | MPR1_MST0 );
		XBAR.MPR3.R = ( MPR3_MST2 | MPR3_MST1 | MPR3_MST0 );
		XBAR.MPR6.R = ( MPR6_MST2 | MPR6_MST1 | MPR6_MST0 );
		XBAR.MPR7.R = ( MPR7_MST2 | MPR7_MST1 | MPR7_MST0 );
	#endif /* _MPC5554_ */

	#ifdef _MPC5561_
		/* Master0 (core)     priority 0                              */
		/* Master1 (eDMA)     priority 1                              */
		/* Master2 (EBI)      priority 2                              */
		/* Master6 (FlexRay)  priority 3                              */
		XBAR.MPR0.R = ( MPR0_MST6 | MPR0_MST2 | MPR0_MST1 | MPR0_MST0 );
		XBAR.MPR1.R = ( MPR1_MST6 | MPR1_MST2 | MPR1_MST1 | MPR1_MST0 );
		XBAR.MPR3.R = ( MPR3_MST6 | MPR3_MST2 | MPR3_MST1 | MPR3_MST0 );
		XBAR.MPR5.R = ( MPR5_MST6 | MPR5_MST2 | MPR5_MST1 | MPR5_MST0 );
		XBAR.MPR6.R = ( MPR6_MST6 | MPR6_MST2 | MPR6_MST1 | MPR6_MST0 );
		XBAR.MPR7.R = ( MPR7_MST6 | MPR7_MST2 | MPR7_MST1 | MPR7_MST0 );
	#endif /* _MPC5561_ */

	#if defined(_MPC5565_) || defined(_MPC5567_)
		/* While the MPC5565 does not have the FEC or FlexRay     */
		/*   module, the XBAR has master ports 3 and 6, and these */
		/*   must be given a unique value in the Master Priority  */
		/*   Registers to prevent conflicts.                      */
		/* Master0 (core)    priority 0                           */
		/* Master1 (eDMA)    priority 1                           */
		/* Master2 (EBI)     priority 2                           */
		/* Master3 (FEC)     priority 3                           */
		/* Master6 (FlexRay) priority 4                           */
		XBAR.MPR0.R = ( MPR0_MST6 | MPR0_MST3 | MPR0_MST2 | MPR0_MST1 | MPR0_MST0 );
		XBAR.MPR1.R = ( MPR1_MST6 | MPR1_MST3 | MPR1_MST2 | MPR1_MST1 | MPR1_MST0 );
		XBAR.MPR3.R = ( MPR3_MST6 | MPR3_MST3 | MPR3_MST2 | MPR3_MST1 | MPR3_MST0 );
		XBAR.MPR6.R = ( MPR6_MST6 | MPR6_MST3 | MPR6_MST2 | MPR6_MST1 | MPR6_MST0 );
		XBAR.MPR7.R = ( MPR7_MST6 | MPR7_MST3 | MPR7_MST2 | MPR7_MST1 | MPR7_MST0 );
	#endif /* _MPC5565_ | _MPC5567_ */

	/* Configuration settings for Slave channels              */
	/* XBAR_SGPCRs are set to  Read/Write, arbitration fixed  */
	/*                                                        */
	/* MPC5533 and MPC5534 have 2 core Master XBAR ports.     */
	/* Parking should use both master 0 and master 4          */
	/*                                                        */
	/* Slave0 (flash)    park on Master0 (core instruction)   */
	/* Slave1 (EBI)      park on Master0 (core instruction)   */
	/* Slave4 (SRAM)     park on Master4 (core load/store)    */
	/* Slave6 (PbridgeA) park on Master4 (core load/store)    */
	/* Slave7 (PbridgeB) park on Master4 (core load/store)    */
	/*                                                        */
	/* For all other devices all slave ports can be parked on */
	/*   master 0 (default settings).                         */
	XBAR.SGPCR0.R = ( SGPCR0_RO | SGPCR0_ARB | SGPCR0_PCTL | SGPCR0_PARK );
	XBAR.SGPCR1.R = ( SGPCR1_RO | SGPCR1_ARB | SGPCR1_PCTL | SGPCR1_PARK );
	XBAR.SGPCR3.R = ( SGPCR3_RO | SGPCR3_ARB | SGPCR3_PCTL | SGPCR3_PARK );
#ifdef MPC5554
	XBAR.SGPCR6.R = ( SGPCR6_RO | SGPCR6_ARB | SGPCR6_PCTL | SGPCR6_PARK );
#endif
	XBAR.SGPCR7.R = ( SGPCR7_RO | SGPCR7_ARB | SGPCR7_PCTL | SGPCR7_PARK );

	#ifdef _MPC5561_
		XBAR.SGPCR5.R = ( SGPCR5_RO | SGPCR5_ARB | SGPCR5_PCTL | SGPCR5_PARK );
	#endif /* _MPC5561_ */
} /* End of cfg_XBAR */

